{
    "countries": [
        {
            "id": 1,
            "name": "Australia",
            "cities": [
                {
                    "name": "Sydney, Australia",
                    "imageUrl": "Sydney.png",
                    "description": "A vibrant city known for its iconic landmarks like the Sydney Opera House and Sydney Harbour Bridge."
                },
                {
                    "name": "Melbourne, Australia",
                    "imageUrl": "Melbourne.png",
                    "description": "A cultural hub famous for its art, food, and diverse neighborhoods."
                }
            ]
        },
        {
            "id": 2,
            "name": "Japan",
            "cities": [
                {
                    "name": "Tokyo, Japan",
                    "imageUrl": "Tokyo.png",
                    "description": "A bustling metropolis blending tradition and modernity, famous for its cherry blossoms and rich culture."
                },
                {
                    "name": "Kyoto, Japan",
                    "imageUrl": "Kyoto.png",
                    "description": "Known for its historic temples, gardens, and traditional tea houses."
                }
            ]
        },
        {
            "id": 3,
            "name": "Brazil",
            "cities": [
                {
                    "name": "Rio de Janeiro, Brazil",
                    "imageUrl": "RioDeJaneiro.png",
                    "description": "A lively city known for its stunning beaches, vibrant carnival celebrations, and iconic landmarks."
                },
                {
                    "name": "São Paulo, Brazil",
                    "imageUrl": "SaoPaulo.png",
                    "description": "The financial hub with diverse culture, arts, and a vibrant nightlife."
                }
            ]
        }
    ],
    "temples": [
        {
            "id": 1,
            "name": "Angkor Wat, Cambodia",
            "imageUrl": "AngkorWat.png",
            "description": "A UNESCO World Heritage site and the largest religious monument in the world."
        },
        {
            "id": 2,
            "name": "Breehadeshwar, India",
            "imageUrl": "Breehadeshwar_temple.png",
            "description": "Brihadeshwara Temple, also known as Brihadisvara Temple, is an architectural masterpiece and a testament to the rich cultural heritage of India. Located in Thanjavur, Tamil Nadu, this UNESCO World Heritage site is renowned for its grandeur, intricate carvings, and towering vimana (temple tower). Built by the Chola emperor Raja Raja I in the 11th century, the temple stands as a marvel of Dravidian architecture and engineering prowess."
        }
    ],
    "beaches": [
        {
            "id": 1,
            "name": "Bora Bora, French Polynesia",
            "imageUrl": "BoraBora.png",
            "description": "An island known for its stunning turquoise waters and luxurious overwater bungalows."
        },
        {
            "id": 2,
            "name": "Swaraj Dweep, Andaman Island, India",
            "imageUrl": "SwarajDweep.png",
            "description": "Swaraj Dweep is a true gem nestled within the Andaman archipelago. Renowned for its stunning natural beauty, Swaraj Dweep offers visitors a slice of paradise with its pristine beaches, lush greenery, and captivating underwater world."
        }
    ]
}